Revit 2024 API
ReferenceBaseOnHostType Enumeration
 This enumeration is used to classify the Reference Base on Host type .
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public enum ReferenceBaseOnHostType
Visual Basic
Public Enumeration ReferenceBaseOnHostType
Visual C++
public enum class ReferenceBaseOnHostType
Members
Member name | Description
PrimaryEnd
SecondaryEnd
Midpoint
See Also
Autodesk.Revit.DB Namespace